bierner.markdown-emoji
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
fcrespo82.markdown-table-formatter
george-alisson.html-preview-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
github.vscode-pull-request-github
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-python.black-formatter
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.live-server
ms-vscode.remote-explorer
qezhu.gitlink
rebornix.project-snippets
streetsidesoftware.code-spell-checker
vstirbu.vscode-mermaid-preview
wayou.vscode-todo-highlight
wenfangdu.snippet-generator
yzhang.markdown-all-in-one